#такой вопрос
# есть такой список с вложенными элементами
ph_book = [['1.№', '2.Имя', '3.Отчество', '4.Фамилия', '5.№тел.', '6.Заметки'], 
        ['001', 'Сергей', 'Сергеевич', 'Сергеев', '24585822', 'сосед'], 
        ['002', 'Иванна', 'Ивановна', 'Иванова', '25896587', 'рабочий']]
# как изменить, т.е. отредактирлвать значние ph_book[i][j] с помощью (input(string))
# или ещё как-нибудь. Типа:

ph_book[1][1] = (input(ph_book[1][1]+' ' ))
print(ph_book[1][1])

# но только не вводить новое значение, а именно изменять ph_book[1][1] 