# 3. Напишите программу, которая определит позицию второго вхождения 
# строки в списке либо сообщит, что её нет.

# *Пример:*
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3           - ok
# - список: ["йцу", "фыв", "ячс", "цук", "щукен", "йцу"], ищем: "йцу", ответ: 5     - ok
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1          - ok
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1                      - ok
# - список: [], ищем: "123", ответ: -1

print()
str = "qwe"
list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]

count = 0
for i in range(len(list)):
    # print(list[i])
    if str == list[i]:
        count = count + 1
        if count == 2:
            c = i
            break

print(list)
print('-------')

if count == 2:
    print(c)
else:
    print('-1')

print()